{"Declaration-of-the-Right-to-Stutter":{"slug":"Declaration-of-the-Right-to-Stutter","filePath":"Declaration of the Right to Stutter.md","title":"Declaration of the Right to Stutter","links":[],"tags":[],"content":"We, the undersigned, declare that people who stutter should be accepted as having a stutter. We may, or may not, choose to find support to sound fluent or stutter less. That is our right. It is not reasonable to expect or insist that we sound fluent. We stutter. That is how we talk.\n \nIn this time of diversity, adjustments are too often not given to those who stutter, be it at work, education or using everyday services. The expectation is rather that we should strive to ‘overcome’ our stutter and speak differently. As individuals we may wish, and even try, to do so. But as a community we refute the idea that we all stop stuttering.\n \nNo organization can claim to value equality or diversity unless stuttering voices are permitted and valued. We call upon every organization and institution to work with people who stutter to make sure that all of us are given the respect every person deserves; and that space is made for us.\n \nIt is our right to speak as we do.\nwww.stamily.org/declaration"},"index":{"slug":"index","filePath":"index.md","title":"NLSA Research & Accessibility","links":[],"tags":[],"content":"NLSA Research &amp; Accessibility Project\nWelcome to a growing collection of notes on accessibility, stuttering,\nand sociolinguistic research in Newfoundland and Labrador."},"learn/community-workshops":{"slug":"learn/community-workshops","filePath":"learn/community-workshops.md","title":"Community Workshops","links":["gander","corner-brook","happy-valley-goose-bay","labrador-city","st-johns"],"tags":[],"content":"Community Workshops\nCommunity workshops are a central part of the Accessibility Project. These workshops create shared spaces for people who stutter (PWS), families, educators, clinicians, and community partners to come together, learn from one another, and collectively imagine more communicatively accessible communities in Newfoundland and Labrador.\nRather than treating accessibility as a technical problem to be solved by experts alone, the workshops are designed as collaborative spaces where lived experience, professional knowledge, and community insight all carry equal weight.\n\nWhat Happens in a Workshop?\nEach workshop is structured around three core goals:\n1. Listening to Lived Experience\nParticipants hear directly from people who stutter about:\n\nNavigating healthcare, education, and public life\nExperiences of stigma, misunderstanding, and support\nWhat accessibility feels like in everyday interaction\n\n2. Understanding Communication as Accessibility\nWe explore:\n\nCommunication differences as part of human diversity\nHow institutions often privilege fluency and speed\nHow everyday interactional norms can unintentionally exclude\n\n3. Building Local Strategies\nTogether, we:\n\nIdentify concrete barriers in local contexts\nShare existing community strengths\nCo-design small, realistic changes that improve accessibility\n\n\nWho Are the Workshops For?\nWorkshops are open to:\n\nPeople who stutter (youth and adults)\nParents and family members\nTeachers and school staff\nSpeech-language pathologists and healthcare workers\nEmployers and community organizers\nPolicy and service stakeholders\n\nEach workshop is adapted to the needs and interests of the local community.\n\nWorkshop Locations\nWe are hosting workshops across Newfoundland and Labrador, including:\n\ngander\ncorner-brook\nhappy-valley-goose-bay\nlabrador city\nst-johns\n\nEach location page documents:\n\nLocal themes\nParticipant questions\nAccessibility priorities\nEmerging action ideas\n\n\nAccessibility Commitments\nOur workshops prioritize:\n\nFlexible participation formats\nNo pressure to speak\nRespect for disfluency\nClear communication pacing\nMultiple ways to contribute (speaking, writing, listening)\n\nAccessibility is treated not as an accommodation, but as a shared responsibility.\n\nOutcomes of the Workshops\nInsights from the workshops directly inform:\n\nSurvey and interview interpretation\nCommunity-facing resources\nPolicy conversations\nTraining materials\nThe evolving definition of communicative accessibility in NL\n\n\nJoin a Workshop\nIf you would like to attend, host, or help shape a workshop in your community, please contact the Newfoundland and Labrador Stuttering Association (NLSA) info@nlstuttering.ca or project lead pauldd@mun.ca.\nWorkshops are free, collaborative, and community-driven.\n\nThis page will continue to grow as workshops take place and new communities join the project."},"learn/ethics-and-values":{"slug":"learn/ethics-and-values","filePath":"learn/ethics-and-values.md","title":"Ethics & Values","links":[],"tags":["learn"],"content":"Ethics &amp; Values\nThis project is grounded in ethical, collaborative, and justice-oriented research practices.\nOur work is guided by:\n\nTCPS2 ethical principles\nCommunity-based research frameworks\nDisability justice perspectives\nDialogic approaches to communication\n\nPeople who stutter are not positioned as research “subjects,” but as:\n\nPartners\nCo-researchers\nKnowledge holders\n\nWe treat accessibility not as an accommodation added later, but as a core research principle from the outset."},"learn/interviews":{"slug":"learn/interviews","filePath":"learn/interviews.md","title":"Interviews","links":[],"tags":["learn"],"content":"Interviews\nSemi-structured interviews form the second phase of the project.\nInterviews explore:\n\nPersonal communication histories\nEncounters with healthcare and education\nExperiences of stigma and support\nNavigating public life as a person who stutters\n\nInterviews are conducted using accessible, participant-centred protocols. Participants control:\n\nPacing\nQuestion selection\nModes of response\nLevels of disclosure\n"},"learn/methods-overview":{"slug":"learn/methods-overview","filePath":"learn/methods-overview.md","title":"Methods Overview","links":[],"tags":["learn"],"content":"Methods Overview\nThe Accessibility Project uses a mixed-methods, community-engaged research design. Our approach prioritizes:\n\nLived experience as expertise\nEthical collaboration\nAccessibility as both a method and an outcome\nTransparency across all stages of research\n\nThe project unfolds in multiple phases:\n\nA province-wide survey\nSemi-structured interviews\nCommunity meetings and workshops\nKnowledge mobilization through media, events, and public engagement\n\nEach phase informs the next, allowing the project to remain responsive to community needs."},"learn/survey":{"slug":"learn/survey","filePath":"learn/survey.md","title":"Survey","links":[],"tags":["learn"],"content":"Survey\nThe project begins with a province-wide survey designed to assess:\n\nAccess to speech-language pathology services\nBarriers to participation\nExperiences in schools, healthcare, and workplaces\nCommunity and policy gaps\n\nThe survey is open to:\n\nPeople who stutter\nFamily members\nClinicians\nEducators\nCommunity stakeholders\n\nFindings from the survey guide the interview phase and the community meetings."},"start-here/what-this-project-is":{"slug":"start-here/what-this-project-is","filePath":"start-here/what-this-project-is.md","title":"What This Project Is","links":[],"tags":["start-here"],"content":"What This Project Is\nThe Accessibility Project is a multi-stage research and community-engagement initiative focused on identifying and removing barriers to full participation for people who stutter (PWS) in Newfoundland and Labrador.\nWe are building a coalition across health care, education, community groups, and lived-experience advocates to understand:\n\nWhere accessibility gaps exist\nHow PWS navigate services and communication environments\nWhat supports are missing\nHow communities can become more inclusive\n\nThis site provides an evolving, transparent view into the research process, our methods, our partners, and the outcomes of this work."},"start-here/who-we-are":{"slug":"start-here/who-we-are","filePath":"start-here/who-we-are.md","title":"Who We Are","links":[],"tags":["start-here"],"content":"Who We Are\nThis project is a collaboration among:\n\nPeople who stutter (PWS)\nNewfoundland and Labrador Stuttering Association (NLSA)\nMemorial University of Newfoundland (MUN)\nEducators, clinicians, policymakers, and community allies\n\nOur team is committed to ethical, community-engaged, and accessible research.\nWe combine sociolinguistics, disability studies, lived experience, and qualitative research methods to build a more inclusive province for people who communicate differently."},"start-here/why-accessibility-matters":{"slug":"start-here/why-accessibility-matters","filePath":"start-here/why-accessibility-matters.md","title":"Why Accessibility Matters in NL","links":[],"tags":["start-here"],"content":"Why Accessibility Matters in Newfoundland and Labrador\nPeople who stutter (PWS) often face structural, communicative, and attitudinal barriers across health services, schools, workplaces, and public life.\nIn Newfoundland and Labrador, accessibility gaps are shaped by:\n\nLimited public speech-language pathology services\nUneven access across rural and urban regions\nCultural narratives surrounding communication and fluency\nA lack of policy frameworks that include communication disability\n\nUnderstanding these barriers is essential to building a province where PWS can participate fully, be heard, and experience dignity in communication.\nThis project places PWS at the centre of the conversation, using collaborative and justice-oriented research practices."}}